"""# Создайте строку numbers, содержащую цифры от 0 до 9.
# Создайте строку letters, содержащую маленькие буквы от a до z.

numbers = "0123456789"
letters = "abcdefghijklmnopqrstuvwxyz"

# Не удаляйте код ниже: он нужен для проверки.

print(numbers, letters)

# Со стандартного ввода подается название корпорации из трех слов.
# Составьте строку из первых букв. Используйте print(... , end="") для вывода значений без переноса строки.
word_1 = input("word_1: ")
word_2 = input("word_2: ")
word_3 = input("word_3: ")

print(word_1[0] + word_2[0] + word_3[0])

# У вас есть строка. Со стандартного ввода подается индекс.
# Получите символы на соответствующем месте и выведите его.

word = "ABCDEFGHIJK"

index = int(input("index: "))

print(word[index])

# У вас есть строка. Со стандартного ввода подаются три индекса.
# Получите символы на соответствующих местах и выведите их.

word = "ABCDEFGHIJK"
i1 = int(input("i1: "))
i2 = int(input("i2: "))
i3 = int(input("i3: "))

# Измените код ниже

print(word[i1])
print(word[i2])
print(word[i3])


# У вас есть строка. Выведите ее с помощью цикла по одной букве на каждой строке.
# Пример вывода:
# M
# E
# O
# W

word = "PYTHONIC"

for char in word:
    print(char)


# У вас есть строка. Выведите с помощью цикла все символы, кроме пробелов.
# Чтобы вывести символы на одной строке, используйте print(..., end="").
# Пример вывода:
# THISISFINE

line = "STRINGS ARE AWESOME"

for char in line:
    if char != " ":
        print(char, end="")


# Со стандартного ввода вы получаете строку.
# Выведите последовательность, состоящую из 0 и 1.
# Остальные символы можно отбросить.
# Пример ввода:
# 0110 1002 911
# Пример вывода:
# 011010011

line = input("line: ")

for char in line:
    if char == "0" or char == "1":
        print(char, end="")


# Со стандартного ввода подается строка, состоящая из цифр (других символов в строке нет).
# Просуммируйте цифры и выведите ответ. Помните, что кусочек строки — тоже строка.
# Пример ввода:
# 111
# Пример вывода:
# 3

numbers = input("numbers: ")
result = sum(int(num) for num in numbers)

print(result)


# У вас есть три строки. Выведите длину каждой из них на новой строке, затем выведите общую длину всех строк.
# Пример ввода:
# Alfa
# Bravo
# Uniform

# Пример вывода:
# 4
# 5
# 7
# 16

line_1 = "Python"
line_2 = "Java"
line_3 = "Go"

l1 = len(line_1)
l2 = len(line_2)
l3 = len(line_3)

print(l1, l2, l3, l1 + l2 + l3, sep="\n")


# У вас есть три строки. Выведите среднюю длину слов. Округлять значение не нужно.
line_1 = "Python"
line_2 = "Java"
line_3 = "Go"

res_list = []
res_list.extend([len(line_1), len(line_2), len(line_3)])

print(sum(res_list) / len(res_list))

l1 = len(line_1)
l2 = len(line_2)
l3 = len(line_3)

print((l1 + l2 + l3) / 3)


# Со стандартного ввода подается слово. Определите его длину и выведите:
# «короткое слово», если длина слова 0–3 символа;
# «среднее слово», если длина слова 4–7 символов;
# «длинное слово», если длина слова 8 и более символов.
# Пример ввода:
# Код

# Пример вывода:
# короткое слово

# Пример ввода:
# четыре

# Пример вывода:
# среднее слово

word = input("word: ")
result = ""

if 0 < len(word) <= 3:
    result = "короткое слово"
elif 4 <= len(word) <= 7:
    result = "среднее слово"
elif len(word) >= 8:
    result = "длинное слово"

print(result)


# Со стандартного ввода подается слово. Выведите количество звездочек, соответствующее длине слова.
# Пример ввода:
# Кодер

# Пример вывода:
# *****


word = input("word: ")
result = ""

result += "*" * len(word)
print(result)


# Со стандартного ввода подаются два слова. Определите, какое слово длиннее.
# Если первое слово длиннее, выведите «первое», если второе — выведите «второе».
# Если слова одинаковой длины — выведите «одинаковые».
word_1 = input("word1: ")
word_2 = input("word2: ")

if len(word_1) > len(word_2):
    result = "первое"
elif len(word_1) < len(word_2):
    result = "второе"
else:
    result = "одинаковые"

print(result)


# Алиса часто зависает в сообществах по криптографии и заметила интересную функцию.
# Когда она пишет сообщение, в редакторе отображается, сколько в нем символов.
# Алиса решает написать похожую программу для подсчета количества слов в тексте.
# Со стандартного ввода подается длинная строка, в которой слова разделены пробелом.
# Программа должна вывести общее количество слов в тексте.
#
# Подсказка: количество слов в тексте обычно равно количеству пробелов в нем + 1.
#
# Пример ввода:
# Горизонтали на огромной шахматной доске отделены друг от друга ручейками.
# Вертикали — живыми изгородями. В продолжение всей игры Алиса остается позади
# Королевы — лишь последним ходом, став сама королевой, она берет Черную Королеву,
# чтобы поставить мат дремлющему Черному Королю.

# Вывод:
# Количество слов: 39

text = input("text: ")

result = text.split()

print(f"Количество слов: {len(result)}")

# У вас есть три слова. Соедините их в одно и выведите его.
word_1 = "arbeiter"
word_2 = "unfall"
word_3 = "versicherung"

result = word_1 + word_2 + word_3

print(result)


# Со стандартного ввода подается слово. Добавьте к слову «крылышки» с помощью конкатенации.
# Пример ввода:
# PYTHON

# Пример вывода:
# ==PYTHON==

word = input("word: ")
decoration = "=="

print(decoration + word + decoration)


# Со стандартного ввода подается последовательность 0 и 1.
# На ее основе составьте строку из слов true и false.

# Пример ввода:
# 01010

# Пример вывода:
# FalseTrueFalseTrueFalse

sequence = input("sequence: ")
result = ""

for char in sequence:
    if char == "1":
        result += "True"
    else:
        result += "False"

print(result)


# Со стандартного ввода подается строка.
# Запишите ее в новую переменную, удалив пробелы и символы подчеркивания
# (если очередной символ — символ подчеркивания, то не добавляйте его в новую строку).

# Пример ввода:
# python_variables are_awesome

# Пример вывода:
# pythonvariablesareawesome

line = input("line: ")

line_spaceless = [char for char in line if char != " " and char != "_"]

print("".join(line_spaceless))


# Со стандартного ввода поступает слово. «Откусите» у него первую и последнюю буквы, затем выведите слово.
#
# Пример ввода:
# Океания

# Пример вывода:
# кеани

word = input("word: ")

print(word[1:-1])


# Со стандартного ввода поступает слово. Замените звездочками все буквы, кроме первых двух и последней.

# Эта задача сложнее остальных, если запутались — подсказка внизу.
#
# Пример ввода:
# Океания

# Пример вывода:
# Ок****я

word = input("word: ")
result = word[:2] + len(word[2:-1]) * "*" + word[-1:]

print(result)


# Со стандартного ввода поступает слово. Выведите все буквы после третьей.

# Пример ввода:
# Океания

# Пример вывода:
# ания

word = input("word: ")
result = word[3:]

print(result)


# Со стандартного ввода поступает слово. Используя цикл range и срезы, отрезайте от него всё больше и больше букв.
#
# Пример ввода:
# Океания

# Пример вывода:
# Океания
# кеания
# еания
# ания
# ния
# ия
# я

word = input("word: ")
result = "\n".join([word[i:] for i in range(len(word))])

print(result)


# Со стандартного ввода поступает слово. Используя цикл range (max, min, − 1) или срезы [::-1], переверните слово.
#
# Пример ввода:
# океания

# Пример вывода:
# яинаеко

word = input("word: ")
result = word[::-1]

print(result)

sample = "маленькая змея Василиса говорит «с-с-с-с»!"
print(sample[-1:-2:-1])

# Вы уже знакомы с операторами in / not in, но практика никогда не бывает лишней.
# Со стандартного ввода подается фраза. Если это вопрос (внутри содержится символ «?»),
# то нужно вывести «Тут есть вопрос», иначе — «Тут нет вопроса».
#
# Пример ввода:
# Едят ли кошки мошек?

# Пример вывода:
# Тут есть вопрос

word = input("word: ")
result = "Тут есть вопрос" if "?" in word else "Тут нет вопроса"

print(result)

# Со стандартного ввода подается буква. Определите, является ли она гласной, и выведите.
# Пример ввода:
# o

# Пример вывода:
# Это гласная

# Пример ввода:
# z

# Пример вывода:
# Это не гласная

vowels = "aeiouy"
letter = input("letter: ")

result = "Это гласная" if letter in vowels else "Это не гласная"

print(result)


# У вас есть список строк. Со стандартного ввода подается подстрока.
# Выведите те строки из списка, в которых встречается полученная подстрока.
#
# Пример ввода:
# се

# Пример вывода:
# семь
# семнадцать

# Пример ввода:
# про

# Пример вывода:
# пропуск
# прочее

words = ["семь", "семнадцать", "пропуск", "прочее", "печенье"]
symbols = input("symbols: ")

result = "\n".join([word for word in words if symbols in word])
print(result)

# Со стандартного ввода подается строка. Выведите количество единиц в ней.
# Вы можете решить это задание перебором или использовать функцию count().
#
# Пример ввода:
# B1C1C1E

# Пример вывода:
# 3
line = input("line: ")
print(line.count("1"))


# Со стандартного ввода поступает фраза. Посчитайте, сколько раз в ней встречается буква «р». Выведите ответ числом.
#
# Пример ввода:
# Краб крабу сделал грабли

# Пример вывода:
# 3
line = input("line: ")
print(line.count("р"))


# Со стандартного ввода поступает фраза. Посчитайте, сколько раз в ней встречается слово «если». Выведите ответ числом.
#
# Пример ввода:
# если «если» перед «после», значит, «после» после «если»

# Пример вывода:
# 3

# Пример ввода:
# значит, «после» перед «если»

# Пример вывода:
# 1
words = input("words: ")
print(words.count("если"))

# Со стандартного ввода поступают два слова, разделенные пробелом. Замените пробел на нижнее подчеркивание.
#
# Пример ввода:
# python coder

# Пример вывода:
# python_coder

words = input("words: ")
print(words.replace(" ", "_"))


# Со стандартного ввода поступает фраза, содержащая звездочки в неожиданных местах. Удалите их все.
#
# Пример ввода:
# Thi*s is *the pytho*nic wa*y

# Пример вывода:
# This is the pythonic way

words = input("words: ")
print(words.replace("*", ""))


sample = "маленькая змея Василиса говорит с-с-с-с!"

# sample.title()
# sample.lower()
# sample.upper()

print(sample)


# Со стандартного ввода поступает фраза, разделенная пробелами.
# Разделите фразу по пробелам и выведите каждое слово на отдельной строке.
#
# Пример ввода:
# Alfa Bravo Charlie Delta

# Пример вывода:
# Alfa
# Bravo
# Charlie
# Delta

words = input("words: ")
print("\n".join(words.split()))


# Со стандартного ввода поступает в виде строки последовательность чисел, разделенная пробелами.
# Разделите строку по пробелам и просуммируйте числа. Выведите сумму в виде целого числа.
#
# Пример ввода:
# 2 3 4 5

# Пример вывода:
# 14

numbers = input("numbers: ")
result = sum([int(num) for num in numbers.split()])
print(result)


# Алиса и Борис придумали новую игру: переслать друг другу закодированные сообщения.
# В фильме про американских военных они подсмотрели кодирование букв с помощью слов.
#
# Например, такая фраза:
# Papa Yankee Tango Hotel Oscar November

# кодирует слово PYTHON (берутся первые буквы каждого слова).
# — Это уже не шутки! — хмурится Александр Васильевич.
# — Не шутки, а фонетический алфавит НАТО! Надо быстро писать программу, чтобы расшифровать послание!
#
# Пример вывода:
# EXAMPLE
code = "Echo Sierra Charlie Alfa Papa Echo"
result = "".join([word[0] for word in code.split()])

print(result)


# Со стандартного ввода поступает в виде строки последовательность чисел,
# разделенная пробелами. Разделите строку по пробелам и найдите самое большое и самое маленькое число.
# Пример ввода:
# 2 3 4 5

# Пример вывода:
# min: 2
# max: 5

numbers = input("numbers: ")

num_list = [int(num) for num in numbers.split()]

min_num = min(num_list)
max_num = max(num_list)

print(f"min: {min_num}\nmax: {max_num}")


# Со стандартного ввода поступает в виде строки пара «количество:цена»,
# разделенная двоеточием. Разделите строку по двоеточию и вычислите стоимость.
# Стоимость = количество * цена.
#
# Пример ввода:
# 5:100

# Пример вывода:
# 500

data = input("data: ")

result = data.split(":")
cost = int(result[0]) * int(result[1])

print(cost)


# Новая забава Алисы и Бориса — обмениваться сообщениями, в которых много лишнего шума, например цифр.
# Впрочем, это не проблема, если есть программа, которая разделит строку по пробелам и оставит только слова
# (а цифры пропустит). Чтобы проверить, является ли строка числом, используйте метод isdigit(),
# а чтобы проверить, является ли строка набором букв, — isalpha().
text = (
    "734 122 мне 877 119 022 кажется 127 0 0 1 за 192 168 нами 255 255 следят 32 32 2 5"
)
just_words = [word for word in text.split() if word.isalpha()]
text_cleaned = " ".join(just_words)


print(text_cleaned)
"""

# У вас есть список строк. Соедините их в одну через «_» с помощью join() и выведите ее.
#
# Пример вывода:
# ALFA_BRAVO_CHARLIE_DELTA

words = ["ALFA", "BRAVO", "CHARLIE", "DELTA"]
print("_".join(words))
