'''1.1. Вывести на одной строке числа 31, 18 и 79 с одним пробелом между ними.
Текст '31 18 79' не использовать.'''
import math

# a = 31
# b = 18
# c = 79
#
# print(a, b, c)

'''1.2. Вывести на одной строке числа 47, 52 и 150 с двумя пробелами между ними.
Текст '47 52 150' не использовать.'''
# a = 47
# b = 52
# c = 150
#
# print(a, b, c, sep='  ')

'''1.3. Вывести на экран числа 50 и 10 одно под другим.'''
# a = 50
# b = 10
#
# print(a, b, sep='\n')

'''1.4. Вывести на экран числа 5, 10 и 21 одно под другим.'''
# a = 5
# b = 10
# c = 21
#
# print(a, b, c, sep='\n')

'''1.5. Получить на экране следующее:
1
2'''
# print(1, 2, sep='\n')

'''1.6. Число π примерно равно 3,1415926. Вывести на экран это число с тремя цифрами в дробной части.
Текст '3.142' не использовать.'''
# print(round(math.pi, 3))

'''1.7. Число e (основание натурального логарифма) приблизительно равно 2,71828.
Вывести на экран это число с точностью до десятых. Текст '2.7' не использовать.'''
# print(round(math.e, 1))

'''1.8. Составить программу вывода на экран числа, вводимого с клавиатуры.
Выводимому числу должно предшествовать сообщение «Вы ввели число».'''
# user = int(input(""))
# print("Вы ввели число", user)

'''1.9. Составить программу вывода на экран числа, вводимого с клавиатуры.
После выводимого числа должно следовать сообщение «– вот какое число Вы ввели».'''
# user = int(input(""))
# print(user, "– вот какое число Вы ввели")

'''1.10. Составить программу, которая запрашивает имя человека и повторяет его на экране.'''
# name = input("Введите ваше имя: ")
# print(name)

'''1.11. Составить программу, которая запрашивает название футбольной команды и повторяет его на
экране со словами «–это чемпион!».'''
# team = input("Введите название футбольной команды: ")
# print(f'{team} – это чемпион!')

'''1.12. Напишите программу, в которую вводится имя человека и выводится на экран приветствие в виде слова «Привет»,
после которого должна стоять запятая, введенное имя и восклицательный знак.
После запятой должен стоять пробел, а перед восклицательным знаком пробела быть не должно.'''
# name = input("Введите ваше имя: ")
# print(f'Привет, {name}!')

'''1.13. Напишите программу, в которую вводится целое число, после чего на экран выводится следующее и предыдущее целое
число. Например, при вводе числа 15 на экран должно быть выведено:
Следующее за числом 15 число – 16.
Для числа 15 предыдущее число – 14.'''

number = int(input("Введите число: "))
print(f'Следующее за числом 15 число – {number + 1}\nДля числа 15 предыдущее число – {number - 1}.')

'''1.14. Составить программу вывода на экран в одну строку трех любых чисел, вводимых с клавиатуры, 
с двумя пробелами между ними.'''

'''1.15. Составить программу вывода на экран в одну строку четырех любых чисел, 
вводимых с клавиатуры, с одним пробелом между ними.'''

'''1.16. Составить программу вывода на экран следующей информации:
а) 5 10 б) 100 t в) x 25
      7 см    1949 v   x y
Примечание
t, v, x и y – переменные величины целого типа, значения
которых вводятся с клавиатуры и должны быть выведены
вместо имен величин.
'''

'''1.17. Составить программу вывода на экран следующей ин-
формации:
а) 2 кг б) а 1 в) x y
   13 17   19 b   5 y
Примечание
a, b, x и y – переменные величины целого типа, значения
которых вводятся с клавиатуры и должны быть выведены
вместо имен величин.'''