# n = 0
#
# while n < 1000:
#     print(n)
#     n += 1
#
# a = 0
# b = 1
# c = 15
#
# while b < c + 1:
#     a += b
#     b += 1
#
# print(a)


# password = 'Password'
#
# while (user_input := input("Enter password: ")) != password:
#     pass
#
# print('Successfully entered')

# start, stop = [int(num) for num in input().split()]
#
# while start <= stop:
#     print(start**3, end=' ')
#     start += 1
"""
Вы играете компьютерным персонажем в ролевую игру.
По своей наивности и вере во вселенскую доброту. Вы выпили колбочку с
надписью "НЕ ЯД". Кто бы мог подумать, что это окажется не так... Начальное здоровье вашего персонажа вводится в виде
целого числа. Яд тратит здоровье со скоростью 5 hp в секунду.
С помощью цикла определите через сколько секунд ваш персонаж потеряет свои хит поинты(здоровье).
Результат вывести на экран.
"""

# start_hp = int(input())
# timer = 0
#
# while start_hp > 0:
#     start_hp -= 5
#     timer += 1
#
# print(timer)

""" 
Необходимо запустить цикл. На каждой итерации с консоли вводится целое число. 
Подсчитайте сумму всех введенных чисел. Выход из цикла - число "0".
 """
# total_sum = 0
#
# while (user_input := int(input())) != 0:
#     total_sum += user_input
#
# print(f'Total sum: {total_sum}')

"""
Есть список чисел в котором необходимо удалить все числа 13. Итоговый список вывести на экран.
"""
# вводные данные
# lst = [23, 1, 45, 87, 13, 32, 98, 11, 5, 1, 90, 345, 5, 13, 33,
#        56, 41, 11, 10, 12, 66, 543, 13, 83, 13, 78, 55, 22, 9]
# number = None
#
# while 13 in lst:
#     lst.remove(13)
#
# print(lst)


"""
2378 год... Есть автомат по продаже дополнительных минут жизни. 
На вход подается вещественное число(стоимость минуты). 
Нужно вывести на экран стоимость 1, 2 , 3 , ...10 минут жизни в одну строку через пробел.
"""

# minute_cost = float(input())
# start = 1
# stop = 10
#
# while start <= stop:
#     print(minute_cost * start, end=' ')
#     start += 1

"""
Вводится строка. В ней нужно заменить идущие подряд дефисы("--", "---", "----" и т.д.) на одинарные "-". 
Вывести измененную строку на экран.
--с--чего-ты----взял---что----у--меня-запал----дефис?-
"""
# string = input('str: ')
# new_string = ''
# start = 0
#
# while start < len(string):
#
#     if start + 1 != len(string) and string[start] == '-' and string[start + 1] == '-':
#         new_string += ''
#     else:
#         new_string += string[start]
#     start += 1
#
# print(new_string)

"""
На свиноферме есть 2 поросенка - Ниф-Ниф и Наф-Наф. На вход подается 2 целых числа в одну строку через пробел. 
Где первое - вес Ниф-Нифа, второе - вес Наф-Нафа. Вес Ниф-Нифа гарантированно меньше, но он не отчаивается и хочет 
стать как Наф-Наф или даже больше, и ест как не в себя. 
Его вес утраивается в год, а вес Наф-Нафа удваивается. Через сколько целых лет Ниф-Ниф нагонит или перегонит Наф-Нафа.
"""

nif_weight, naf_weight = [int(weight) for weight in input().split()]
years = 0

while nif_weight <= naf_weight:
    nif_weight *= 3
    naf_weight *= 2
    years += 1

print(years)